#!/usr/bin/python
# -*- coding: utf-8 -*-
import multiprocessing
import logging

"""
    @packageName : file
    @fileName : config.py
    @author : incheols
    @date : 2023. 1. 4. 오전 09:52:52
    @content : 기본 설정 정보
"""


"""
    네이버 
"""

logging.getLogger("urllib3").setLevel(logging.WARNING)

MODEL_PATH = 'common/model/word2vec.model'

# MultiprocesPoolSize

MULTIPROCESS_POLL_SIZE = int(multiprocessing.cpu_count())

# 카테고리
NAVER_NEWS_CATEGORY_JSON={
    '정치': '100',
    '경제': '101',
    '사회': '102',
    '생활_문화': '103',
    'IT_과학': '105',
    '세계': '104',
    # '연예': 'entertain',
    # '스포츠' : 'sports',
    # 'e소프츠' : 'game'
}

# 하위 카테고리
NAVER_NEWS_SUB_CATEGORY_JSON={
    '100': {
        '대통령실': '264',
        '국회_정당': '265',
        '북한': '268',
        '행정': '266',
        '국방_외교': '267',
        '정치일반': '269'
    },
    '101': {
        '금융': '259',
        '증권': '258',
        '산업_재계': '261',
        '중기_벤처': '771',
        '부동산': '260',
        '글로벌경제': '262',
        '생활경제': '310',
        '경제 일반': '263'
    },
    '102': {
        '사건사고': '249',
        '교육': '250',
        '노동': '251',
        '언론': '254',
        '환경': '252',
        '인권_복지': '59b',
        '식품_의료': '255',
        '지역': '256',
        '인물': '276',
        '사회 일반': '257'
    },
    '103': {
        '건강정보': '241',
        '자동차_시승기': '239',
        '도로_교통': '240',
        '여행_레저': '237',
        '음식_맛집': '238',
        '패션_뷰티': '376',
        '공연_전시': '242',
        '책': '243',
        '종교': '244',
        '날씨': '248',
        '생활_문화 일반': '245'
    },
    '105': {
        '모바일': '731',
        '인터넷_SNS': '226',
        '통신_뉴미디어': '227',
        'IT 일반': '230',
        '보안_해킹': '732',
        '컴퓨터': '283',
        '게임_리뷰': '229',
        '과학 일반': '228'
    },
    '104': {
        '아시아_호주': '231',
        '미국_중남미': '232',
        '유럽': '233',
        '중동_아프리카': '234',
        '세계 일반': '322'
    },
    'entertain': {
        '연예가화제': '221',
        '방송_TV': '224',
        '드라마': '225',
        '뮤직': '7a5',
        '해외연예': '309',
    },
    'sports': {
        '야구': 'kbaseball',
        '해외야구': 'wbaseball',
        '축구': 'kfootball',
        '해외축구': 'wfootball',
        '농구': 'basketball',
        '배구': 'volleyball',
        '골프': 'golf',
        '일반': 'general',
    },
    'game': {
        'lol': 'League_of_Legends',
        'pubg': 'Player_Unknowns_Battle_Grounds',
        'starcraft2': 'Starcraft_II_Legacy_of_the_Void',
        'esports_general': 'general'
    }
}
# 언론사
NAVER_NEWS_PRESS_JSON ={
    '032': '경향신문',
    '005': '국민일보',
    '020': '동아일보',
    '021': '문화일보',
    '081': '서울신문',
    '022': '세계일보',
    '023': '조선일보',
    '025': '중앙일보',
    '028': '한겨레',
    '469': '한국일보',
    '421': '뉴스1',
    '003': '뉴시스',
    '001': '연합뉴스',
    '422': '연합뉴스TV',
    '449': '채널A',
    '215': '한국경제TV',
    '437': 'JTBC',
    '056': 'KBS',
    '214': 'MBC',
    '057': 'MBN',
    '055': 'SBS',
    '374': 'SBS Biz',
    '448': 'TV조선',
    '052': 'YTN',
    '009': '매일경제',
    '008': '머니투데이',
    '648': '비즈니스워치',
    '011': '서울경제',
    '277': '아시아경제',
    '018': '이데일리',
    '366': '조선비즈',
    '123': '조세일보',
    '014': '파이낸셜뉴스',
    '015': '한국경제',
    '016': '헤럴드경제',
    '079': '노컷뉴스',
    '629': '더팩트',
    '119': '데일리안',
    '417': '머니S',
    '006': '미디어오늘',
    '031': '아이뉴스24',
    '047': '오마이뉴스',
    '002': '프레시안',
    '138': '디지털데일리',
    '029': '디지털타임스',
    '293': '블로터',
    '030': '전자신문',
    '092': 'ZDNet Korea',
    '665': '더스쿠프',
    '145': '레이디경향',
    '024': '매경이코노미',
    '308': '시사IN',
    '586': '시사저널',
    '262': '신동아',
    '094': '월간 산',
    '243': '이코노미스트',
    '033': '주간경향',
    '037': '주간동아',
    '053': '주간조선',
    '353': '중앙SUNDAY',
    '036': '한겨레21',
    '050': '한경비즈니스',
    '127': '기자협회보',
    '662': '농민신문',
    '607': '뉴스타파',
    '584': '동아사이언스',
    '310': '여성신문',
    '007': '일다',
    '640': '코리아중앙데일리',
    '044': '코리아헤럴드',
    '296': '코메디닷컴',
    '346': '헬스조선',
    '654': '강원도민일보',
    '087': '강원일보',
    '658': '국제신문',
    '657': '대구MBC',
    '656': '대전일보',
    '088': '매일신문',
    '082': '부산일보',
    '659': '전주MBC',
    '655': 'CJB청주방송',
    '661': 'JIBS',
    '660': 'kbc광주방송',
    '348': '신화사 연합뉴스',
    '077': 'AP연합뉴스',
    '091': 'EPA연합뉴스',
}

NEWS_PRESS_JSON = {
    'mpmbc.co.kr' : '목포MBC',
    'newsmaker.or.kr' : '뉴스메이커',
    'nspna.com' : 'NSP통신',
    'travelitoday.com' : '트래블투데이',
    'unn.net' : '목포MBC',
    'dt.co.kr' : '디지털타임스',
    'thegolftimes.co.kr' : '골프타임즈',
    'sportsworldi.com' : '스포츠월드',
    'munhwa.com' : '문화일보',
    'asiatoday.co.kr' : '아시아투데이',
    'jnilbo.com' : '전남일보',
    'jeonmae.co.kr' : '전국매일신문'
}
